app/controllers/hello_controller.rb

SELECT * FROM `service_requests` WHERE (`service_requests`.`id` = 3)
---
  def service_request
    id = params[:id]
    @req = ServiceRequest.find(id)

INSERT INTO `service_requests` (`created_at`, `updated_at`, `token`, `status_updated_at`, `service_id`, `fields`, `aid`, `phone_number`, `service_code`, `description`, `status`, `email`) VALUES('2009-06-22 00:55:34', '2009-06-22 00:55:34', '5be2b531-20d7-44a8-bc25-f079d6b61120', NULL, NULL, '--- !map:HashWithIndifferentAccess \nABDBIC-RUSTY: \"Yes\"\nABDBIC-HOWLONG: \"13\"\nABDBIC-NOWHEELS: \"Yes\"\nABDBIC-DAMAGES: \"\"\naid: \"68205\"\nABDBIC-MODELB: Children\'s\nservice_code: S0021\nABDBIC-AIRINTIRES: \"Yes\"\ndescription: Nope!\nphone_or_email: \"3012199183\"\nABDBIC-COLORB: Black\nABDBIC-LOCKED: Bike Rack\n', '68205', '3012199183', 'S0021', 'Nope!', NULL, NULL)
---
  def post
    answers = params['answer']
    result =     DCGOV::Open311.submit(answers)
    logger.debug(result.inspect)
    service_request = ServiceRequest.new
    service_request.aid = answers['aid']
    service_request.description = answers['description']
    phone_or_email = answers['phone_or_email']
    unless phone_or_email.empty?
      if phone_or_email.include? "@"
        service_request.email = phone_or_email
      else
        service_request.phone_number = phone_or_email.sub(/[^0-9]/, '')
      end
    end
    service_request.fields = answers.to_yaml
    service_request.token = result
    service_request.service_code = answers['service_code']
    service_request.save

SELECT * FROM `service_requests` WHERE (`service_requests`.`phone_number` = '3012199183')
---
  def check
    if request.post?
      phone_or_email = params['phone_or_email']
      if phone_or_email.include? "@"
        @results = ServiceRequest.find_all_by_email phone_or_email
      else
        @results = ServiceRequest.find_all_by_phone_number phone_or_email.sub(/[^0-9]/, '')

SELECT * FROM `service_requests` WHERE (`service_requests`.`service_id` IS NULL)
SELECT * FROM `service_requests` WHERE (`service_requests`.`id` = 4)
---
  def update
    #first find all service requests.
    @nil_requests = ServiceRequest.find_all_by_service_id nil
    @nil_requests.each { |i|
      i.get_service_id
      unless i.service_id.nil?
        begin
          i.notify_in_system
        rescue
          logger.warn("Something went wrong when updating new reqs: #{$!}")
        end

      end
    }

    @reqs = ServiceRequest.find(:all,:conditions=>['service_id IS NOT NULL'])

UPDATE `service_requests` SET `updated_at` = '2009-06-22 01:25:38', `is_silenced` = 1 WHERE `id` = 19
---
  def shush
    sr_id = params[:id]
    ServiceRequest.update(sr_id, {:is_silenced=>true})