app/controllers/remote_controller.rb

  def _grab_map_points
    phone_or_email = params["phone_or_email"]
    if phone_or_email.include? "@"
      @results = ServiceRequest.find_all_by_email phone_or_email
    else
      @results = ServiceRequest.find_all_by_phone_number phone_or_email.sub(/[^0-9]/, '')
---
SELECT * FROM `service_requests` WHERE (`service_requests`.`email` = 'zvi@skeevisarts.com')
SELECT * FROM `service_requests` WHERE (`service_requests`.`phone_number` = '3012199183')